{
  "Lacunar Stroke": "Typical symptoms: Dizziness, Headache, Numbness in the left hand, True, unsteady vision. Sample follow‑up: ",
  "Neural Damage": "Typical symptoms: Hand stiffness, Poor hand function, Radial artery rupture, Tendon Liquefaction and Rupture, Tendon overlapping, Thirteen Tendon Ruptures, True, Without sensation, Wrist cut by glass, postoperative infection. Sample follow‑up: ",
  "Lactational Mastitis": "Typical symptoms: Dizziness, Headache, Increased body temperature, Left chest pain upon pressure, True. Sample follow‑up: ",
  "Plasma Cell Mastitis": "Typical symptoms: Delayed menstruation, Newly developed lump, Prolactin test not updated, Swelling and redness, True, Tumor Healing, menstrual cycle returned to normal. Sample follow‑up: ",
  "Lymphadenitis": "Typical symptoms: Acne, Low autoimmunity, Lymphadenopathy, True, Uneven lymph nodes in the internal neck and submandibular area. Sample follow‑up: ",
  "Chronic Prostatitis": "Typical symptoms: Difficulty in achieving an erection, Erectile Dysfunction, Lower Abdominal Distension, No morning erections, Prostatic congestion and swelling, Scrotal dampness, True, Urinary retention, Weak urinary stream, urethral irritation. Sample follow‑up: ",
  "Hepatocellular Carcinoma": "Typical symptoms: Repeated hematemesis, True, Unable to eat, Unable to move, rectal bleeding. Sample follow‑up: ",
  "Cervical Spondylosis": "Typical symptoms: Autonomic dysfunction, Electric buzzing tinnitus, Scalp numbness, Straightening of cervical curvature, Sympathetic Nervous System Excitation, True. Sample follow‑up: ",
  "Cholangitis": "Typical symptoms: Abdominal pain, True, Vomiting, Yellow Sputum. Sample follow‑up: ",
  "Phimosis": "Typical symptoms: Erect length only 8 cm, False, True, Uncircumcised, Weight 77 kilograms, height 175 centimeters. Sample follow‑up: ",
  "Hemorrhoids": "Typical symptoms: Anal itching, Dry skin around the anus, Irregular eating and resting habits, Perianal moisture, Perianal pain, Slight bleeding after bowel movement, True, dry mouth and tongue. Sample follow‑up: ",
  "Ventricular Septal Defect": "Typical symptoms: False, Heavy breathing, Myocardial Damage, Normal growth, Taller and stronger than peers, True. Sample follow‑up: ",
  "Traumatic Ulcer": "Typical symptoms: Bite Wound, Intermittent Pain, Tongue ulcer, True. Sample follow‑up: ",
  "Traumatic Brain Injury": "Typical symptoms: Cough, Frequent awakenings, Head trauma, Involuntary nodding, Nasal congestion, True, Vomiting. Sample follow‑up: ",
  "Chronic Cholecystitis": "Typical symptoms: Bile Reflux, History of fatty liver, Liver discomfort, True, gallbladder area pain. Sample follow‑up: ",
  "Anal Fissure": "Typical symptoms: Bloody stools, Constipation, Hard stools, Milk rejection, True. Sample follow‑up: ",
  "Cervical Spondylotic Myelopathy": "Typical symptoms: Numbness in both hands, Paresthesia of extremities, Slightly slurred speech, True, Walking like a robot. Sample follow‑up: ",
  "Rectal Cancer": "Typical symptoms: Anemia, Dull abdominal pain, Fatigue, Stool is unformed, True, increased frequency of bowel movements, rectal bleeding. Sample follow‑up: ",
  "Cholecystitis": "Typical symptoms: Abdominal pain, Bitter Taste in Mouth, Hip discomfort, Pain above and below the navel, True. Sample follow‑up: ",
  "Brain Injury": "Typical symptoms: Coma, High blood pressure, Intracranial hemorrhage, Skull fracture, Slight opening of both eyes, True. Sample follow‑up: ",
  "Mastitis": "Typical symptoms: Fluid accumulation in the left breast, Left breast mass, Left breast pain, Small Lump Near the Right Breast Axilla, True. Sample follow‑up: ",
  "Cerebrospinal Fluid Rhinorrhea": "Typical symptoms: Avoid eating with head bent down, Lies down to rest immediately after eating, Nasal discharge during eating, No change in urine glucose test strip color, Rest in bed as much as possible, True, Watery Sensation in the Nostrils. Sample follow‑up: ",
  "Lumbar Disc Herniation": "Typical symptoms: Family history of hypertension, Overexertion, Severe leg pain, True. Sample follow‑up: ",
  "Urinary Tract Infection (UTI)": "Typical symptoms: Burning sensation in the lower abdomen, Elevated white blood cells in urine, Increased discomfort during urination, Lower abdominal distension, True, Urethral burning sensation, Urethral orifice irritation and pain, Urinary difficulty. Sample follow‑up: ",
  "Small Cell Lung Cancer": "Typical symptoms: History of chronic smoking, Hyperglycemia, Hypertension, True, Unable to undergo radiotherapy and chemotherapy, Weakness. Sample follow‑up: ",
  "Prostate Cancer": "Typical symptoms: Hyperlipidemia, Hypertension, Lower back pain, Prostatic hyperplasia, True. Sample follow‑up: ",
  "Urinary System Calculi": "Typical symptoms: Back Pain, Constipation, Lower Abdominal Cramps, Pain disappears when bladder is full, Symptoms after drinking alcohol, True. Sample follow‑up: ",
  "Hand Trauma": "Typical symptoms: Crush injury of palm and fingers, Crushed finger with exposed bone, Large-area inflammation and swelling, No improvement after one week of anti-inflammatory injection treatment, True, darkening around the joints. Sample follow‑up: ",
  "Anal Pruritus": "Typical symptoms: Anal Itching, Intermittent Symptoms, Severely affects life, Started last December, True. Sample follow‑up: ",
  "Breast Hyperplasia": "Typical symptoms: 20-year history of mammary gland hyperplasia, Breast Discharge, Breast Parenchymal Nodule, Change in discharge color, Elevated prolactin levels, True. Sample follow‑up: ",
  "Prostatitis": "Typical symptoms: Frequent urination, Left varicocele, Nodule at the base of the penis, Pain at the base of the penis, True, Urethral Irritation, Urgency to urinate. Sample follow‑up: ",
  "Cervical Radiculopathy": "Typical symptoms: Nausea, Night pain affects sleep, Numbness in fingers, Occasional dizziness, Shoulder pain, Symptoms worsen after physical exertion, True, Worsening neck pain, dry mouth with no desire to drink water. Sample follow‑up: ",
  "Pleural Effusion": "Typical symptoms: Chest pain, Increased Diastasis Lesions, Increased pulmonary effusion, Poorly visualized nodule, Right Lung Effusion, Shortness of breath, True, Tuberculous pleurisy turned negative, aspiration of yellow fluid. Sample follow‑up: ",
  "Buried Penis": "Typical symptoms: Occasional Testicular Elevation, Phimosis, True, genitalia smaller than normal size. Sample follow‑up: ",
  "Popliteal Cyst": "Typical symptoms: Joint effusion, Popliteal Vein Dilation, True, popliteal cyst, subcutaneous fat thickening. Sample follow‑up: ",
  "Balanitis": "Typical symptoms: Skin prone to cracking, Thin, bright red skin, True, Urethral irritation. Sample follow‑up: ",
  "Lower Limb Venous Thrombosis": "Typical symptoms: Difficulty walking, Lower Limb Pain, Lower limb swelling, True. Sample follow‑up: ",
  "Atrial Septal Defect (ASD)": "Typical symptoms: Arrhythmia, Depressive symptoms, Hyperthyroidism, Post-cardiac surgery residual defect, True. Sample follow‑up: ",
  "Intestinal obstruction": "Typical symptoms: Abdominal pain lasting about three hours, Cannot eat soft and mushy noodles, Diet restricted to rice soup, Flatulence, Nasointestinal decompression tube used for more than seventeen days, Postprandial Abdominal Pain, True. Sample follow‑up: ",
  "Perianal Abscess": "Typical symptoms: Breastfeeding, Diarrhea, Five to six bowel movements per day, No Bowel Movement at Night, Perianal abscess, True. Sample follow‑up: ",
  "Cholangiolithiasis": "Typical symptoms: Back Pain, Liver and gallbladder stones, Subrenal Cyst, True, general weakness. Sample follow‑up: ",
  "Thyroid Nodules": "Typical symptoms: Frequently in a bad mood, Stomach discomfort, Thyroid micronodule, True, Unhealthy diet, Weight Gain. Sample follow‑up: ",
  "Renal Pelvis Cancer": "Typical symptoms: Decreased GFR in Right Kidney, Decreased GFR of the left kidney, Elevated creatinine, Hematuria, Increased urea, Increased uric acid, Moderate reduction in renal function, Reduced Red Blood Cell Count, Reduced hemoglobin, Slightly Reduced Blood Flow in Right Kidney, Soft tissue nodule in left renal pelvis, True. Sample follow‑up: ",
  "Acute Cystitis": "Typical symptoms: Desire to defecate without passage of stool, Dysuria, Feeling of bladder distension, Feeling of incomplete bladder emptying, True, Urethral discomfort, Urgency to urinate. Sample follow‑up: ",
  "Balanoposthitis": "Typical symptoms: Inadequate cleaning, Localized Purulent Discharge, Painful urination, Swelling and redness, True. Sample follow‑up: ",
  "Purulent Meningitis": "Typical symptoms: Body temperature of 37.5°C, Calcium deficiency, Premature birth, Slight muscle cramps, True. Sample follow‑up: ",
  "Plantar Fasciitis": "Typical symptoms: Degenerative changes of the lumbar spine, Discomfort on the left side of the left foot, Herniation of L4/5 and L5/S1 intervertebral discs, Pain in both heels, Pain relief after resting at night, Tendinitis, True, lumbar pain. Sample follow‑up: ",
  "Internal Hemorrhoids": "Typical symptoms: Anal discomfort, Pain, Sensation of rectal prolapse, True. Sample follow‑up: ",
  "Lumbar and Sciatic Pain": "Typical symptoms: Left buttock pain, Pin-like pain, Swelling pain, Toe pain, True. Sample follow‑up: ",
  "Fibroadenoma of the Breast": "Typical symptoms: Breast Pain, Increased pain before and after menstruation, Internal lump in the breast, Pain intensifies when emotionally excited, Sensation of gas on the right side of the uterus, True. Sample follow‑up: ",
  "Ureteral Calculi": "Typical symptoms: Pain in the lumbar and abdominal area, True, Vomiting, feeling of needing to defecate but unable to. Sample follow‑up: ",
  "Cervical Spinal Cord Injury": "Typical symptoms: Inability to expectorate, Lung Infection, Total paralysis, True, difficulty breathing. Sample follow‑up: ",
  "Hypospadias": "Typical symptoms: Dystocia cesarean section, Full-term small for gestational age infant, Hypospadias, Placenta Accreta, Poor weight gain, True, Ventricular septal defect. Sample follow‑up: ",
  "Esophageal Cancer": "Typical symptoms: Chest distension, Dysphagia, Smoking, True, Weight loss, drinking alcohol. Sample follow‑up: ",
  "Neurogenic Bladder": "Typical symptoms: Bladder roughening and thickening, Developmental Delay, Oliguria, Premature birth, Recurrent Urinary Tract Infections, Spinal cord tethering, True. Sample follow‑up: ",
  "Hydrocele": "Typical symptoms: Occasionally enlarged scrotum, Scrotum occasionally biased to one side, Scrotum occasionally without folds, True. Sample follow‑up: ",
  "Menstrual Disorders": "Typical symptoms: Delayed menstruation, Irregular menstruation at the beginning of the period, Menstrual impurity, Progesterone therapy, True, ovarian cyst. Sample follow‑up: ",
  "Primary Dysmenorrhea": "Typical symptoms: Allergic Rhinitis, Easily fatigued, Multiple fibromas, Poor appetite, Stool occult blood turning from positive to negative, True, Vomiting, dysmenorrhea. Sample follow‑up: ",
  "Premature Infant": "Typical symptoms: Anemia, Blood transfusion, Brain changes, Failed fundus screening, Low birth weight, True. Sample follow‑up: ",
  "Adenomyosis": "Typical symptoms: Bladder compression, Dropping sensation in the lower abdomen, Severe dysmenorrhea, True. Sample follow‑up: ",
  "Vulvar Pruritus": "Typical symptoms: Dryness, Mild itching at the vaginal opening, True, White flakes at the vaginal opening. Sample follow‑up: ",
  "Ectopic Pregnancy": "Typical symptoms: Amenorrhea for 40 days, Decreased progesterone levels, Mild abdominal pain, No gestational sac found in or outside the uterus on ultrasound, Slight decrease in hCG levels, Test strip positive, True. Sample follow‑up: ",
  "Endometrial Cancer": "Typical symptoms: Abnormal Vaginal Bleeding, Fatigue, Sudden weight loss, True, pelvic pain. Sample follow‑up: ",
  "Candidal Vaginitis": "Typical symptoms: Especially itchy vulva, Itching at the urethral opening, Itchy despite washing, Sleep Disorders, True. Sample follow‑up: ",
  "Vaginitis": "Typical symptoms: Colorless and odorless vaginal discharge, Increased abnormal vaginal discharge, Mucous-like Elongated Vaginal Discharge, Slightly sticky transparent vaginal discharge, True, White curdy discharge. Sample follow‑up: ",
  "Embryo Arrest": "Typical symptoms: Increased vaginal discharge, Missed miscarriage discovered at eight weeks of pregnancy, No longer bleeding, Size about six weeks, True, Vulvar itching. Sample follow‑up: ",
  "Infertility": "Typical symptoms: Female endocrine normal, Female fallopian tube patency, Female has normal ovulation, Female hormone levels are normal, Female with normal thyroid function, Female with regular menstruation, Female's immune system is normal, Male erectile dysfunction, Normal forward motility of male sperm, Normal ovulation induction regimen for female, True, Unsuccessful pregnancy attempt after one year. Sample follow‑up: ",
  "Threatened Miscarriage": "Typical symptoms: Low Estradiol in Early Pregnancy, Progesterone Levels, True, hCG Level Fluctuations. Sample follow‑up: ",
  "Vulvitis": "Typical symptoms: Itching, Scratch-induced bleeding, True, Vulvar papules, relieved after using Dermatol. Sample follow‑up: ",
  "Polycystic Ovary Syndrome (PCOS)": "Typical symptoms: Irregular Menstruation, Low estrogen, Menstrual Cycle Extended to About 40 Days, Reduced menstrual flow, Severe facial acne, True. Sample follow‑up: ",
  "Breast Eczema": "Typical symptoms: Acne near the chest, Especially Itchy, Hardness inside the chest, True. Sample follow‑up: ",
  "Ovarian Cyst": "Typical symptoms: Menstrual cycle extended to 35-40 days, Mittelschmerz, Reduced menstrual flow, Right Lower Abdominal Pain, Short menstrual duration within the cycle, True. Sample follow‑up: ",
  "Endometrial Polyps": "Typical symptoms: Abnormal object in the uterus, Fallopian Tube Cyst, Prolonged menstrual period, True. Sample follow‑up: ",
  "Ovarian Tumors": "Typical symptoms: Abdominal swelling, Abnormal Urination, Frequent urination, True. Sample follow‑up: ",
  "Uterine Fibroids": "Typical symptoms: Bleeding Outside of the Menstrual Cycle, Feeling of abdominal sinking, Increased Menstrual Flow, Iron deficiency anemia, Prolonged menstrual period, True. Sample follow‑up: ",
  "gestational diabetes mellitus": "Typical symptoms: Early bleeding, Elevated blood sugar levels, Failed glucose tolerance test, No weight gain and even loss in the past week, Pre-pregnancy blood glucose levels slightly above normal range, True. Sample follow‑up: ",
  "Menopausal Syndrome": "Typical symptoms: Amenorrhea, Forgetfulness, Knee osteoarthritis, Lumbar Spine Protrusion, Night sweats, True. Sample follow‑up: ",
  "Postpartum Rheumatism": "Typical symptoms: Joint pain, Muscle pain, True, tendency to feel cold. Sample follow‑up: ",
  "Dysmenorrhea": "Typical symptoms: Abdominal pain, Blood clot, True, Upset Stomach. Sample follow‑up: ",
  "Pelvic Inflammatory Disease (PID)": "Typical symptoms: Anal heaviness, Genital heaviness, Left lower abdominal distension and pain, Sore and swollen lower back, Tenderness during Gynecological Examination, True, Urgency to urinate. Sample follow‑up: ",
  "Amenorrhea": "Typical symptoms: Excessive consumption of cold drinks, Has not menstruated in nearly three months, Irregular eating habits, Poor Sleep, True. Sample follow‑up: ",
  "Ovulatory Dysfunction": "Typical symptoms: No Pregnancy After Taking Clomiphene, True, Two years of infertility despite trying to conceive, Unable to conceive despite repeated intercourse, use of ovulation test strips. Sample follow‑up: ",
  "Cervical Erosion": "Typical symptoms: Groin odor, Increased vaginal discharge, True, premenstrual abdominal pain. Sample follow‑up: ",
  "Abnormal Leukorrhea": "Typical symptoms: Increased vaginal discharge, Occasional Odd Smell, True, Visible vaginal discharge for a few days each month. Sample follow‑up: ",
  "Chronic Pelvic Inflammatory Disease (PID)": "Typical symptoms: Bacterial vaginosis, Frequent episodes, Lower back pain, True, mild lower abdominal pain. Sample follow‑up: ",
  "Endometriosis": "Typical symptoms: Anal dropping pain, Brown Menstrual Blood, Dysmenorrhea disappearance after childbirth, History of left ovarian cystectomy, Lower abdominal cramping, Menstruation came early, Periodic abdominal pain, Reduced menstrual flow, Severe dysmenorrhea, True, right ovarian cyst. Sample follow‑up: ",
  "Trichomonas Vaginitis": "Typical symptoms: Clitoral wart-like papules, Excessive watery, yellowish-green vaginal discharge, Mild Burning Sensation During Urination, Painful intercourse with blood traces, True. Sample follow‑up: ",
  "Perimenopausal Syndrome": "Typical symptoms: Amenorrhea, High work stress, Insomnia, Mild breast hyperplasia, Subacute thyroiditis, True, hot flashes. Sample follow‑up: ",
  "Cervical Polyp": "Typical symptoms: Brown Vaginal Discharge, Cervical os laxity, Risk of Miscarriage, Risk of bleeding, Suspected deep polyp length, True, Twins. Sample follow‑up: ",
  "Ovarian Cancer": "Typical symptoms: Abdominal pain, Difficulty in defecation, Enlarged chocolate cyst, Reduced appetite, Stool is dark and dry, True, elevated CA125 level. Sample follow‑up: ",
  "Gynecological Inflammation": "Typical symptoms: Dizziness, Increased Frequency of Urination, True, post-coital dysuria. Sample follow‑up: ",
  "Endometriotic Cyst (Chocolate Cyst)": "Typical symptoms: Cyst enlargement, Heavy menstrual bleeding, Slight pain in the lower right abdomen, True, dysmenorrhea, reduced AMH. Sample follow‑up: ",
  "Hyperprolactinemia": "Typical symptoms: Discontinuation of bromocriptine, Elevated prolactin levels, Miscarriage, True, poor doubling of HCG. Sample follow‑up: ",
  "Bacterial Vaginosis": "Typical symptoms: Mild Pain, Occasionally slightly itchy, Painful sensation during urination, True, Vaginal Introitus Pain, Vulvar swelling, Yellow vaginal discharge. Sample follow‑up: ",
  "Premature Ovarian Failure (POF)": "Typical symptoms: Endocrine disorder, Increased FSH, True, Ultrasound diagnosis of polycystic ovaries, reduced AMH. Sample follow‑up: ",
  "Anterior Vaginal Wall Prolapse": "Typical symptoms: Anterior vaginal wall prolapse, Feeling of heaviness, Limited mobility (fear of squatting, afraid to exert too much effort), Poor uterine involution, True, Uterine prolapse. Sample follow‑up: ",
  "Bronchial Asthma": "Typical symptoms: Dependent on inhaled medication, Nighttime coughing, True, difficulty breathing. Sample follow‑up: ",
  "Colitis": "Typical symptoms: Abdominal pain, Enlargement of left inguinal lymph nodes, Increased Stool Frequency After Stopping Antibiotics, Increased frequency of stool, mucous and snotty in appearance, occasionally streaked with blood, Left leg pain, Left popliteal swelling, Mucoid and bloody stool, Multiple subcutaneous nodules in both legs, Muscle and hip soreness, Pain and swelling in the right groin and thigh, Slight swelling and pain at the root of the left hind leg, Stool Mixed with Pink Necrotic Tissue. Sample follow‑up: ",
  "Allergic Cough": "Typical symptoms: Allergic constitution, Mild atopic dermatitis, Moderate effect of Shunerning, Rhinitis, Temporary relief after nebulization therapy, True, intermittent cough. Sample follow‑up: ",
  "Diabetes": "Typical symptoms: Blood sugar 11.5 on the second day, Blood sugar was 13.2 the day before, Fasting blood glucose 7.8, High blood sugar, Postprandial Blood Sugar Increase, True. Sample follow‑up: ",
  "Upper Respiratory Tract Infection": "Typical symptoms: Borborygmus, Cervical lymphadenopathy, Indigestion, Pharyngitis, True. Sample follow‑up: ",
  "Bronchitis": "Typical symptoms: Cough, Dry Heaving, Expelling brown stringy secretions, Frequent vomiting of milk, True. Sample follow‑up: ",
  "Asthma": "Typical symptoms: Cough, Lung sounds present, Occasional difficulty breathing while sleeping, Occasional phlegm, True. Sample follow‑up: ",
  "Diarrhea": "Typical symptoms: Diarrhea, Feeling somewhat weak, Mild abdominal pain, Nausea, Poor complexion, True. Sample follow‑up: ",
  "Respiratory Tract Infection": "Typical symptoms: Coughing up phlegm, Fever, True, Wheezing. Sample follow‑up: ",
  "Indigestion": "Typical symptoms: Excessive flatulence, Facial Eczema, Indigestion, Intestinal gas, Pink Mucous Stools, Poor sleep at night, Stool contains vegetable residues, True, Visible veins on the face. Sample follow‑up: ",
  "Hereditary Angioedema": "Typical symptoms: Chills, Convulsion, Dizziness, Numbness in hands and feet, Shock, Swelling, True, difficulty breathing. Sample follow‑up: ",
  "Gastroesophageal Reflux Disease (GERD)": "Typical symptoms: Acid reflux, Acid taste in mouth while lying down, Hiccups, True. Sample follow‑up: ",
  "Coronary Heart Disease": "Typical symptoms: Asymptomatic heart, Coronary Artery Stenosis, Hypertension, True. Sample follow‑up: ",
  "Hypothyroidism": "Typical symptoms: Abnormal Bone Metabolism, Insulin resistance, Obesity, True, Weight loss. Sample follow‑up: ",
  "Nephrotic Syndrome": "Typical symptoms: Hypertension, Leg weakness, Lower extremity edema, True, swollen eyes. Sample follow‑up: ",
  "Gastritis": "Typical symptoms: Drug allergy, Easily nauseated and vomits at the sight of disgusting things, Occasional acid reflux, True. Sample follow‑up: ",
  "Sjögren's Syndrome": "Typical symptoms: Blurred Vision, Dry Mouth, Dry Tongue, Red tongue, Sparse tongue coating, Tooth loss, True. Sample follow‑up: ",
  "Pneumonia": "Typical symptoms: Choking cough, Hunchback, Reduced Activity Level, Sudden Brainstem Hemorrhage, True, weight loss. Sample follow‑up: ",
  "Intestinal Spasm": "Typical symptoms: Pain during sleep, Pain every night around 5 or 6 o'clock, Periumbilical pain, True, morning pain, pain lasting from half an hour to two hours, sweating with pain. Sample follow‑up: ",
  "Acute Enteritis": "Typical symptoms: Fever up to 38.5°C, Low-grade fever, True, Vomiting. Sample follow‑up: ",
  "Common Cold": "Typical symptoms: Dizziness, Fatigue, Occasional cough, Reduced appetite, Stomach discomfort, True, Unstable body temperature. Sample follow‑up: ",
  "Tonsillitis": "Typical symptoms: Constipation, Cough, Does not drink water, Elevated C-Reactive Protein, Excessive saliva, Fever recrudescence after normalization of temperature, Fever subsides during the day, Heavy sweating before sleep, Lack of energy, Low-grade fever, Lymphocytosis, Nasal congestion. Sample follow‑up: ",
  "Constipation": "Typical symptoms: Defecating not on the toilet, Does not report after defecation, Hard stool, Irregular bowel movements, Need to use enema for bowel assistance, Stool softening after using polyethylene glycol, True, anal bleeding during defecation, chronic constipation, coarse stool. Sample follow‑up: ",
  "Angina Pectoris": "Typical symptoms: Awakened by pain in the early morning, Dull chest pain, Elevated diastolic blood pressure, Occasional cardiac distension pain, True, forehead cold sweat. Sample follow‑up: ",
  "Acute Gastroenteritis": "Typical symptoms: Dislikes drinking formula, True, Vomiting, diarrhea. Sample follow‑up: ",
  "Autoimmune Hepatitis": "Typical symptoms: Elevated direct bilirubin, History of bile stasis, History of cholecystitis, Positive antinuclear antibody, True, elevated total bilirubin. Sample follow‑up: ",
  "Pulmonary Fibrosis": "Typical symptoms: Difficulty expectorating, Difficulty in moving, Pulmonary fibrosis, Thick Purulent Sputum, True, Use of oxygen machine, difficulty breathing. Sample follow‑up: ",
  "Type 2 Diabetes": "Typical symptoms: Approximately 50% localized stenosis of the left anterior descending coronary artery, Gastrointestinal reaction, Hypoglycemic reaction, Pain and numbness in both lower limbs and hands, True. Sample follow‑up: ",
  "Hyperthyroidism": "Typical symptoms: 13 weeks pregnant, Concerns About Iodized Salt Intake, Medication may affect the fetus, Regular follow-up required for liver, kidney function and complete blood count, Requires Taking Propylthiouracil, Severe hyperthyroidism, True. Sample follow‑up: ",
  "IgA Nephropathy": "Typical symptoms: Cold extremities, Fatigue, Foamy urine, Lower back pain, Poor sleep, Proteinuria, Scanty and dark menstruation, Short menstrual cycle, True, Urinary occult blood, anhidrosis. Sample follow‑up: ",
  "Henoch-Schönlein Purpura Nephritis": "Typical symptoms: Anemia, Back Pain, Facial Skin Allergy, Recurrent Cold, True, Unusually high bacterial count in routine urine test, fever. Sample follow‑up: ",
  "Aspiration Pneumonia": "Typical symptoms: Light and short sleep at night, Severe vomiting of milk, Shortness of breath, True, asphyxia, crying. Sample follow‑up: ",
  "Chronic gastritis": "Typical symptoms: Back Chest Heat, Gastric distension pain, Hiccups, Insomnia, Severe Acid Reflux, True. Sample follow‑up: ",
  "Chronic Pancreatitis": "Typical symptoms: Duodenal bulb inflammation, Familial Hypertension, High bilirubin, Hyperlipidemia, Slight increase in echogenicity of the tail of the pancreas, Slightly higher point-like echogenicity, Superficial gastritis, True. Sample follow‑up: ",
  "Behcet's Disease": "Typical symptoms: Cavernosal fibrosis, Chronic inflammation of the penis, No fluctuation when the left artery is erect, True, superficial vascular occlusion. Sample follow‑up: ",
  "Myocardial Ischemia": "Typical symptoms: Can feel the heart pounding in the chest, Difficulty in breathing, Electrocardiogram shows myocardial ischemia, Hearing heartbeat sounds, Heart Rate 96, Heart rate 60 to 90, Heart rate around 80, Lethargic and Restless, More comfortable in the evening than in the morning, Palpitations, Poor Sleep Quality, Premature Beat. Sample follow‑up: ",
  "Eating Disorder": "Typical symptoms: Anxiety, Binge eating, Depressed mood, Has a stomach disease, Induced Vomiting, Previously on a diet for weight loss, True. Sample follow‑up: ",
  "Ankylosing Spondylitis": "Typical symptoms: Impaired walking, Limited mobility, Limited mobility of the left foot, Mild cold symptoms, Nighttime hip joint pain, Stomach discomfort, True. Sample follow‑up: ",
  "Arrhythmia": "Typical symptoms: Dizziness, Indigestion, Palpitations, True. Sample follow‑up: ",
  "Pulmonary Arterial Hypertension": "Typical symptoms: Abdominal distension, Breathlessness when speaking too fast, Exercise-Induced Asthma, True. Sample follow‑up: ",
  "Chronic Heart Failure": "Typical symptoms: Decreased Ejection Fraction, Increased heart rate, Left ventricular enlargement, Reduced contractility, Reduced diastolic function, Slight soreness in the muscles near the armpit on the left chest, True, slight soreness in the back of the left shoulder and the left chest near the armpit during movement. Sample follow‑up: ",
  "Gout": "Typical symptoms: Difficulty walking, Hypertension, Hyperuricemia, Toe Pain, True. Sample follow‑up: ",
  "Uremia": "Typical symptoms: Creatinine 700, Edema, Proteinuria, Shallow sleep, True, gout. Sample follow‑up: ",
  "Aplastic Anemia": "Typical symptoms: Decreased white blood cell count, Fatigue, Gingival bleeding, Infection after termination of pregnancy surgery, Low hemoglobin level, Reduced Platelet Count, True. Sample follow‑up: ",
  "Pituitary Adenoma": "Typical symptoms: Bad temper, Cerebrospinal fluid rhinorrhea, Emaciation, Eye pain, Lethargy, Loss of appetite, Respiratory distress, Taciturnity, True. Sample follow‑up: ",
  "Acute Pyelonephritis": "Typical symptoms: Body temperature of 38 degrees Celsius, Hematuria, True, Urgency to urinate, fever. Sample follow‑up: ",
  "Functional Dyspepsia": "Typical symptoms: Chest tightness, Foreign body sensation, General weakness, Hiccups, Stomach Pain, True. Sample follow‑up: ",
  "Hypertension": "Typical symptoms: Erectile Dysfunction, High blood pressure, Liver dysfunction, True. Sample follow‑up: ",
  "Pericoronitis": "Typical symptoms: Insomnia, Pain, Pain that worsens at night, Suppuration, True. Sample follow‑up: ",
  "Recurrent Aphthous Stomatitis": "Typical symptoms: Extremely painful, Frequent recurrence, Ineffective Ulcer Patch, No improvement after taking B vitamins, Self-healing duration of about half a month, True. Sample follow‑up: ",
  "Oral Ulcer": "Typical symptoms: Dry Mouth, Poor sleep, Tongue ulcer, True. Sample follow‑up: ",
  "Gingivitis": "Typical symptoms: Blood traces in the mouth and nose upon waking, Gingival bleeding, Gum recession, True. Sample follow‑up: ",
  "Recurrent Aphthous Ulceration": "Typical symptoms: No family history, No obvious effect from routine oral medication, No significant improvement from taking vitamins or heat-clearing drugs, Occurs 2-3 times a month, Recurrent oral ulcers, The episodes last about half a month, True. Sample follow‑up: ",
  "Cheilitis": "Typical symptoms: Cough, Early milk allergy, Frequent Fevers, Recurrent lip swelling, Reduced immunity, Swelling after consuming fish and seafood, True, Vomiting and diarrhea. Sample follow‑up: ",
  "Cleft Lip": "Typical symptoms: Able to Normally Suckle on Pacifier and Breast, Short lingual frenulum, Single feeding amount of 50ml-80ml, Thick base of the tongue, True, Unilateral lip deformity. Sample follow‑up: ",
  "Halitosis": "Typical symptoms: Bad taste in mouth, Easily irritable, Frequent diarrhea, True, prominent tongue coating. Sample follow‑up: ",
  "Chronic Cheilitis": "Typical symptoms: Dry Lips, Granular sensation, Occasional itching, Peeling lips, Rough skin, True, redness around the lips. Sample follow‑up: ",
  "Periodontitis": "Typical symptoms: Ear Base Pain, Emaciation, Generalised weakness, Gum swelling and redness, Loss of Appetite, Severe insomnia, True, loss of appetite. Sample follow‑up: ",
  "Pulpitis": "Typical symptoms: Tooth pain on exposure to cold, Toothache, True, gums without redness, swelling, or bleeding, increased pain at night. Sample follow‑up: ",
  "Chronic Periodontitis": "Typical symptoms: Gingival bleeding, Gingival hyperplasia, Gum bleeding, Gums bleed upon contact with food, Odor between teeth, True, halitosis. Sample follow‑up: ",
  "Oral Thrush": "Typical symptoms: Excessive saliva, Frequent choking cough, Mental status normal, Normal diet, Peeling inside the mouth, True. Sample follow‑up: ",
  "Dental Caries": "Typical symptoms: Absence of pain, Black area feels hard, No Discomfort, True, posterior teeth appear black. Sample follow‑up: ",
  "Hyperdontia": "Typical symptoms: Hyperdontia, Loose Lower Incisors, Loose upper front tooth, True, permanent teeth are serrated, premature teething. Sample follow‑up: ",
  "Alveolar Osteitis": "Typical symptoms: Facial swelling, Pain not relieved by anti-inflammatory and analgesic drugs, Pain relief, Severe pain, True, Unusual odor, Wound with white and yellow substances. Sample follow‑up: ",
  "Angular Cheilitis": "Typical symptoms: Itchy corners of the mouth, Previously had cold sores at the corners of the mouth, Repeated Lip Licking, Symptoms alleviated after sleep, True, dry skin at the corners of the mouth, reddening of the corners of the mouth. Sample follow‑up: ",
  "Dental Trauma": "Typical symptoms: Dental injury due to a fall, Dental swelling, Refusal of non-dairy foods, Tooth Discoloration, True, oral ulcer. Sample follow‑up: ",
  "Herpes Labialis": "Typical symptoms: Angular cheilitis, Body temperature of 37.5°C, Gum swelling and pain, Oral pallor, Pain while eating, Prominent Wrinkles, True, Upper jaw pain. Sample follow‑up: ",
  "Acute Periapical Periodontitis": "Typical symptoms: Loose teeth, Painful dental occlusion, Swelling pain, True. Sample follow‑up: ",
  "Periapical Abscess": "Typical symptoms: Discolored Front Teeth, Excessive dental pus, It hurts a bit when pressed, Lump on the palate reachable by the tongue, Pus is yellowish in color, Tooth swelling, Toothache, True. Sample follow‑up: ",
  "Oral Lichen Planus": "Typical symptoms: Internal blistering, Scalloped tongue, Swelling and pain, True, Ulcer surface cracking, oral ulcer. Sample follow‑up: ",
  "Acute Pulpitis": "Typical symptoms: Headache, Nausea, Toothache, True. Sample follow‑up: ",
  "Toothache": "Typical symptoms: Adjacent tooth pain, Toothache, True, only the crown part removed after wisdom tooth extraction. Sample follow‑up: ",
  "Epilepsy": "Typical symptoms: Drooling, Eye rolling back, Limb twitching, Trismus, True, Unconscious. Sample follow‑up: ",
  "Cerebral Hemorrhage": "Typical symptoms: Cold hands and feet, Head Fever, Headache, Left-sided paralysis, True, head swelling. Sample follow‑up: ",
  "Tourette Syndrome": "Typical symptoms: Blinking, Squinting, True, Vocalization, Whole-body twitching. Sample follow‑up: ",
  "Parkinson's Disease": "Typical symptoms: Body pain at night, Fatigue, Left Hand Incoordination, Left hand tremor, True, affects sleep. Sample follow‑up: ",
  "Cerebral Infarction": "Typical symptoms: Diabetes, Dysphagia, Hypertension, Limb weakness, Slurred Speech, True, ataxia. Sample follow‑up: ",
  "Myasthenia Gravis (MG)": "Typical symptoms: Coughing when drinking water, Dysphagia, Excessive Fatigue, Facial stiffness, Falling while getting on a bus, Muscle weakness, Premature Beat, Slurred speech, Staying up late, Symptoms worsen at night, True, Unable to lift the arm. Sample follow‑up: ",
  "Cerebral Palsy": "Typical symptoms: Able to grasp large objects, unable to grasp small ones, Auscultation and Observation are Feasible, Can eat large particles of food by oneself, Cannot hold the bottle to drink milk by themselves, Intelligence Test score 56, Jaundice appearing after birth, No history of medication treatment, True, Unable to assist in standing, Unable to crawl, Unsteady when sitting alone, inability to understand commands. Sample follow‑up: ",
  "Facial Paralysis": "Typical symptoms: Burning sensation in the eyes, Eye soreness, Facial muscle weakness, True. Sample follow‑up: ",
  "Syncope": "Typical symptoms: Cold hands, Eye rolling back, Pallor, Snoring, Sudden fainting, True. Sample follow‑up: ",
  "Vocal Cord Paralysis": "Typical symptoms: Cough, Lung Infection, True, Vomiting, epiglottic dysfunction, vocal cord compression. Sample follow‑up: ",
  "Cerebral Atrophy": "Typical symptoms: Abnormal behavior and speech, Difficulty walking, Elevated Blood Pressure, Frequent nocturnal activity, Frequent urination, True, Unable to care for oneself, Weight loss, decreased appetite. Sample follow‑up: ",
  "Autonomic Dysregulation": "Typical symptoms: Palpitations, True, palmar sweating, weakness. Sample follow‑up: ",
  "Autonomic Dysfunction": "Typical symptoms: Chest discomfort, Discomfort in the left arm, Poor mood, True. Sample follow‑up: ",
  "Central Precocious Puberty": "Typical symptoms: Height of 152 cm, Long pubic hair, True, Weight 40 kilograms. Sample follow‑up: ",
  "Migraine": "Typical symptoms: Head-tilted Viewing, Mild astigmatism, Multiple ophthalmology visits, Normal ophthalmic examination, True. Sample follow‑up: ",
  "Cerebral Insufficiency": "Typical symptoms: Chest tightness, Clouded consciousness, False, Feeling of heaviness in the head, Headache, Poor Memory, True. Sample follow‑up: ",
  "Wilson's Disease": "Typical symptoms: Cerebellar Atrophy, Hand tremor, Poor motor coordination, Repeated Embryonic Arrest, True, leg paralysis. Sample follow‑up: ",
  "Bell's Palsy": "Typical symptoms: Asymmetrical bulging of the cheeks, Facial asymmetry, Facial deformity, Facial muscle tightness, Incomplete dentition, Incomplete pursing of the lips, Left masseter muscle indentation, Left-sided facial pain, Lower eyelid entropion, Orofacial synkinesis, Smile is slightly crooked, Smooth nasal bridge. Sample follow‑up: ",
  "Neurasthenia": "Typical symptoms: Frequent Nightmares, Low Libido, Poor sleep quality, Short-tempered, True. Sample follow‑up: ",
  "Infantile Spasms": "Typical symptoms: Bloating, Convulsion, Increased seizure frequency, Nighttime Crying, Spasmodic Nodding, True, increased frequency of convulsions. Sample follow‑up: ",
  "Trigeminal Neuralgia": "Typical symptoms: Facial pain, Increased nocturnal pain, Nausea and Vomiting, Onset upon lying flat, Pain upon touch, Sleeping sitting up with difficulty, True. Sample follow‑up: ",
  "Sleep Disorders": "Typical symptoms: Difficulty Falling Asleep, Easily awakened at night, Head fullness, Light Sleep, Morning sweating, Symptoms are more severe in the morning than in the afternoon, Symptoms worsen when lying down, Tinnitus, True. Sample follow‑up: ",
  "Binge Eating Disorder": "Typical symptoms: Anxiety, Binge eating, Induced Vomiting, Nail Biting, Social avoidance, True. Sample follow‑up: ",
  "Developmental Brain Disorders": "Typical symptoms: Developmental Delay, Drooling, Frequent tongue protrusion, Hand mouthing, Intellectual developmental delay, Language Development Delay, Loose root of the tongue, Low muscle tone, True. Sample follow‑up: ",
  "Essential Tremor": "Typical symptoms: Anxiety, Increased Head Tremor, Memory Decline, Poor sleep, Prone to nervousness, True. Sample follow‑up: ",
  "Pancreatic Cancer": "Typical symptoms: Abdominal pain, Diarrhea, Obstructive jaundice, True. Sample follow‑up: ",
  "Cancer": "Typical symptoms: Gastric ulcer, Gastrointestinal Bleeding, Lymphadenopathy, Mesenteric Lymphadenopathy, Thickening of the pyloric wall, True, low hemoglobin. Sample follow‑up: ",
  "Breast Cancer": "Typical symptoms: Heavy menstrual bleeding, Irregular menstruation, True, breast lump. Sample follow‑up: ",
  "Intracranial Tumor": "Typical symptoms: Afraid to move neck, Arching Back, Arm pain after standing or sitting for more than half an hour, Head and neck tilting to the left, Head fatigue, Headache, Intermittent crying at night, Intermittent numbness or pain in the left elbow, Neck Pain after Lying Down for Long Periods, Strabismus, True, Vomiting. Sample follow‑up: ",
  "Gastric Cancer": "Typical symptoms: Emaciation, Low hemoglobin, Multiple blood transfusions, True, rectal bleeding. Sample follow‑up: ",
  "Lung Cancer": "Typical symptoms: Consider using Irinotecan, False, Immunodeficiency, Small nodules present on the liver, Taking apatinib and tigio for three years, True, Tumor growth, Two months since the end of radiotherapy, Worry about rebleeding, pleural effusion. Sample follow‑up: ",
  "Colorectal Cancer": "Typical symptoms: Gastroesophageal Reflux Disease (GERD), Liver cyst, Rectal perforation, True, pelvic effusion, peritonitis. Sample follow‑up: ",
  "Malignant Melanoma": "Typical symptoms: Mole Bleeding, Mole diameter 3-4 mm, Mole flaking intermittently, Mole with a dull surface, True, Whitening in the middle of a mole. Sample follow‑up: ",
  "Strawberry Hemangioma": "Typical symptoms: Darkening of color, Gray-white spots in the middle of the cheeks, Red patch under the eye, Red swelling, True, pale red patches on face. Sample follow‑up: ",
  "Lung Squamous Cell Carcinoma": "Typical symptoms: Common cold, Cough, Facial swelling, Superior vena cava obstruction, True. Sample follow‑up: ",
  "Lung Adenocarcinoma": "Typical symptoms: Bone soreness affecting sleep, Generalized bone soreness and weakness, Loss of appetite, Low-grade fever, Right Substernal Hepatic Region Pain, True, Weakness in both legs, dry cough, night sweats. Sample follow‑up: ",
  "Lung Tumor": "Typical symptoms: Normal appetite, Persistent cough, Poor complexion, True, Weight loss. Sample follow‑up: ",
  "Renal Tumor": "Typical symptoms: Abdominal pain, Hematuria, Sweating while walking, True, fever. Sample follow‑up: ",
  "Neurofibromatosis": "Typical symptoms: Accelerated tumor growth during pregnancy, Back pain, Darkened skin, Localized itching of the tumor, Presence of granular sensation in the tumor, Rapid increase in body bloating, Skin with cafe-au-lait spots, True, Tumor pain, scoliosis. Sample follow‑up: ",
  "Confluent and Reticulated Papillomatosis": "Typical symptoms: Brown reticulated patches, Changes in chest skin, Changes in the skin of hands and feet, Changes in the skin of the forearm, Changes in the skin on the back of the thigh, Changes in underarm skin, Lumbodorsal Skin Changes, Skin changes on the wrist, True, generalized jaundice. Sample follow‑up: ",
  "Orbital Tumor": "Typical symptoms: Blindness in the left eye, More prominent pain upon touching around the left eye, Significant periorbital pain, True, Tumor significantly enlarged. Sample follow‑up: ",
  "Cheek Cancer": "Typical symptoms: History of esophageal cancer, Lichen Planus, Lymph Node Nodule, Oral pain, True, oral ulcer. Sample follow‑up: ",
  "Pancreatic Head Cancer": "Typical symptoms: Alcohol abuse, Generalized jaundice, Nausea and Vomiting, True, abdominal discomfort. Sample follow‑up: ",
  "Carpal Tunnel Syndrome": "Typical symptoms: Finger stiffness, Numbness and weakness, Pain, Pain in the palms and wrist nerves when clenching fists, Palmar edema, True. Sample follow‑up: ",
  "Varicose Veins of Lower Extremity": "Typical symptoms: No other abnormalities, Small blood vessels in leg skin, Thigh Numbness and Swelling, True, no fever. Sample follow‑up: ",
  "Tibiofibular Fracture": "Typical symptoms: Experience of Open Reduction Surgery, External Fixation Use, Left Tibial Fracture, Left fibula fracture, True. Sample follow‑up: ",
  "Synovitis": "Typical symptoms: Increased elastic frequency, Joint crepitus, Periodic exacerbation of symptoms, Prolonged sitting position, Right shoulder crepitus, Sore and swollen left leg, True. Sample follow‑up: ",
  "Cervical Dystonia": "Typical symptoms: Head shaking, Torticollis, True, hand numbness. Sample follow‑up: ",
  "Temporomandibular Joint Disorder": "Typical symptoms: Clicking sound when opening and closing mouth, Emotionally anxious and restless, Facial deformity, Facial fatigue and discomfort, Limited jaw function (can barely open to the width of three fingers), Soreness and swelling of the chin, True, muscle soreness. Sample follow‑up: ",
  "Patellar Dislocation": "Typical symptoms: Knee swelling, Occasional knee pain during movement, True, dislocation of the patella in the left leg, patella moves medially to the right but immovable laterally to the left. Sample follow‑up: ",
  "Clavicle Fracture": "Typical symptoms: Neck pain, Pressing Pain, Swelling in the collarbone area, True, Unable to Embrace the Axilla. Sample follow‑up: ",
  "Soft Tissue Injury": "Typical symptoms: Numbness in the right arm, Pain in the large loop, Petechiae, Right-sided neck and shoulder pain, Skin laceration, True, epidermal swelling. Sample follow‑up: ",
  "Femoral Neck Fracture": "Typical symptoms: Discontinuity of Shenton's line, Discontinuity of the cortical bone of the left femoral neck, Seeing shiny lines, Shortening of the femoral neck, Swelling of the surrounding soft tissue, True. Sample follow‑up: ",
  "Lumbar Spine Disease": "Typical symptoms: Back Pain, Feeling dizzy after treatment, Numbness in Arms and Hands, True, numbness in legs. Sample follow‑up: ",
  "Scoliosis": "Typical symptoms: Height below average for age, Pectus excavatum, Slow weight gain, True. Sample follow‑up: ",
  "Torticollis": "Typical symptoms: Able to turn over, Can sit, Preference for not turning to the side with neck assistance, Preference for turning over to a specific side, True. Sample follow‑up: ",
  "Tenosynovitis": "Typical symptoms: Hot compress did not relieve symptoms, Increased pain on exertion, Left Wrist Pain, Pain near the thumb when bending the wrist, True, Unable to effectively use a wrist brace to alleviate symptoms. Sample follow‑up: ",
  "Ankle Sprain": "Typical symptoms: Ankle injury, Bruising, Pain while walking, Swelling, True. Sample follow‑up: ",
  "Arthritis": "Typical symptoms: Cold intolerance, Palpable movable mass, Shoulder pain, Swelling on both sides of the knee, Thickened tissue above the knee, True, limited mobility. Sample follow‑up: ",
  "Knee Injury": "Typical symptoms: Good knee stabilization strength, Knee effusion, No swelling or redness in the knee, Severe knee pain, True, knee giving way. Sample follow‑up: ",
  "Intertrochanteric Fracture of the Femur": "Typical symptoms: Difficulty walking, Limited mobility, Localized tenderness, Lower Limb Pain, Swelling, True. Sample follow‑up: ",
  "Rotator Cuff Injury": "Typical symptoms: Ineffective Analgesics, Limited mobility, Shoulder and arm pain, True. Sample follow‑up: ",
  "Flatfoot": "Typical symptoms: Painful walking, Recurrent pain in the right foot, Swollen feet, True. Sample follow‑up: ",
  "Osteoarthritis of the Knee Joint": "Typical symptoms: Affects normal life, Restless, Symptoms gradually worsen, True, long-term physical labor. Sample follow‑up: ",
  "Subacute Thyroiditis": "Typical symptoms: Hypertension, Low-grade fever, Lump on the Neck, Poor Digestion, True. Sample follow‑up: ",
  "Multiple Myeloma": "Typical symptoms: Albumin Decrease, Associated with soft tissue density, Bone destruction, High FDG metabolism, Increased M protein in serum protein electrophoresis, Mild renal impairment, Monoclonal protein GAM-λ, Pain relief from oral painkillers, Shoulder and Back Pain, True. Sample follow‑up: ",
  "Phalangeal Fracture": "Typical symptoms: Difficulty walking, Pain in the little toe of the foot, True, localized swelling. Sample follow‑up: ",
  "Genu Varum (Bow Legs)": "Typical symptoms: Can run now, Learned to walk at 11 months, Leg misalignment, True, Walking with an O-shaped gait. Sample follow‑up: ",
  "Brachial Plexus Injury": "Typical symptoms: Left Arm Pain, Left arm numbness, Multiple fractures throughout the body, True, Weakness in the left arm, fingers twitching. Sample follow‑up: ",
  "Lumbar Muscle Strain": "Typical symptoms: Back rib pain, Lower back pain, Pain relief after activity, Tight and distended left lower back when sitting, True. Sample follow‑up: ",
  "Meniscal Injury": "Typical symptoms: Difficulty walking, Increased pain, Local ligament displacement sensation, Needs to find the right position before stepping on the ground, Paroxysmal pain exacerbation, True. Sample follow‑up: ",
  "Synovitis of the Knee Joint": "Typical symptoms: Caught a chill, Knee pain, Possible Contusion, True. Sample follow‑up: ",
  "Varicose Veins": "Typical symptoms: Cold intolerance, Cyanosis of the blood vessels, Numbness in fingertips, Peripheral cooling, Swooshing sound in blood vessels, True, Vascular Bulging, Vascular Pain, Whole body muscle pain. Sample follow‑up: ",
  "Meniscal Injury of the Knee": "Typical symptoms: Avoid heel strike while walking, Inability to fully extend the knee, Knee Pain after Activity, Knee pain when squatting, Sudden knee sounds, True. Sample follow‑up: ",
  "Periarthritis of Shoulder": "Typical symptoms: Back pain, Chest pain, Overweight, Shoulder soreness, True, rheumatism. Sample follow‑up: ",
  "Fasciitis": "Typical symptoms: Localized pain, Low level of usual activity, True, intermittent pain, pregnancy. Sample follow‑up: ",
  "Median Nerve Injury": "Typical symptoms: Atrophy at the distal end of the adductor pollicis muscle, Inability to Exert Force with Hands, Numbness in the tips of the thumb, index, and middle fingers, Strong presence of palm sensation, True, gradual disappearance of numbness in the fingers. Sample follow‑up: ",
  "De Quervain's Tenosynovitis": "Typical symptoms: Chronic Pain, Hand pain, Swollen wrist, True, afraid to exert force. Sample follow‑up: ",
  "Osteoarthritis": "Typical symptoms: Abnormal Gait, Arthritis for several years, Cold intolerance, Daily sensitivity to cold and wind, Left Knee and Calf Pain, Pain in the right knee and lower leg, Relieved by hot compress, Slight pain in the left knee, True, Unable to Squat. Sample follow‑up: ",
  "Distal Radius Fracture": "Typical symptoms: Limited lumbar mobility, True, Wrist Discomfort, Wrist Malunion, Wrist dislocation, lower back pain, swelling of the left wrist. Sample follow‑up: ",
  "Avascular Necrosis of the Femoral Head": "Typical symptoms: Gradually progressive dysphagia, Left Femoral Head Pain, Limited mobility, Right femoral head pain, True. Sample follow‑up: ",
  "Cervical Spondylosis of Sympathetic Type": "Typical symptoms: Difficulty concentrating, Difficulty in visual focusing, Dry and itchy eyes, Headache relieved by lying down, Headache worsened by prolonged bending of the head, Memory decline, Persistent dizziness, Slowed thinking, True. Sample follow‑up: ",
  "Fracture": "Typical symptoms: Chest pain, Fall Injury, Lower limb swelling, Post-exertional angina, True, difficulty breathing. Sample follow‑up: ",
  "Relapsing Polychondritis": "Typical symptoms: CT report indicates tracheal stenosis, Coughing upon slightest irritation, Daytime cough slightly relieved by taking traditional Chinese medicine, Mild Rhinitis, Right-Sided Tracheal Tenderness, Severe coughing at night preventing lying down and sleep, True. Sample follow‑up: ",
  "Ankle Fracture": "Typical symptoms: Fainting, Foot fracture, Foot fracture with dislocation, Increased pain and swelling in the feet when lowered, Suboptimal results after plaster fixation, Swelling and pain in the feet, True. Sample follow‑up: ",
  "Lateral Epicondylitis of the Humerus": "Typical symptoms: Changing positions does not relieve pain, Dull pain with a feeling of distension, Elbow pain, Feels like bone pain rather than muscle pain, Pain from the Elbow to the Fingertips, Pain in the left forearm and fingers 2 to 4, True, pain in the right forearm and little finger. Sample follow‑up: ",
  "Lower Limb Nerve Injury": "Typical symptoms: Anomalous sensation in the ankle, Ataxia, Cramps and soreness in the soles of the feet, Lower limb cramps, Muscle swelling and pain, True. Sample follow‑up: ",
  "Exanthema Subitum (Roseola Infantum)": "Typical symptoms: Diarrhea, Fever, Fussy and crying, Poor mental state, Rash, True. Sample follow‑up: ",
  "Pediatric Constipation": "Typical symptoms: Constipation, Defecation Phobia, Pediatrics, True, fever. Sample follow‑up: ",
  "Congenital Heart Disease": "Typical symptoms: Anemia, Need for Continuous Oxygen Supply, Premature birth, Treatment ineffective, True, Ventricular septal defect. Sample follow‑up: ",
  "Pediatric Enteritis": "Typical symptoms: 3 to 6 Bowel Movements Per Day, Breastfeeding, Faintly positive for occult blood, Fecal test shows white blood cells, No diarrhea during postpartum confinement, No relief of symptoms after taking medicine for 3 days, Pediatrics, True. Sample follow‑up: ",
  "Attention Deficit Hyperactivity Disorder (ADHD)": "Typical symptoms: Concern about exam results, Daydreaming in class, Difficulty maintaining attention during online classes, Feeling tired while doing homework, Frequent headaches, Frequent mumbling, Inability to Concentrate, Irritable mood, Lack of Interest in Things, Noise in the throat while eating, Sudden Cessation of Speech, True. Sample follow‑up: ",
  "Neonatal Seizures": "Typical symptoms: Lasts about 20 seconds, Limb Exertion, Onset of symptoms within half an hour after feeding, True, facial redness, slight eyelid eversion. Sample follow‑up: ",
  "Rickets": "Typical symptoms: Blood phosphorus level was 1.45 on admission and 1.17 on discharge, Blood phosphorus reduced to 0.97, Frequent crying, Hospitalized for pneumonia at 1 month old, Night Terrors, Restless sleep, Severe bowlegs, Starts walking at 23 months, True. Sample follow‑up: ",
  "Infantile Diarrhea": "Typical symptoms: Abdominal bloating, Abdominal pain, Active Bowel Sounds, Diarrhea, Mental state is fair, Relief by slapping buttocks, Soft abdominal wall with no mass, True, crying. Sample follow‑up: ",
  "Neonatal Vomiting": "Typical symptoms: Short daytime sleep duration, Spitting up milk, Stool is yellow, curdy and watery, True, frequent awakening at night, projectile vomiting. Sample follow‑up: ",
  "Kawasaki Disease": "Typical symptoms: Diarrhea, Dry, cracked, peeling lips, Generalized rash, Persistent high fever, Red eyes, True. Sample follow‑up: ",
  "Neonatal Asphyxia": "Typical symptoms: Convulsion, Cyanosis, Fever up to 37.8°C, Gastric tube blood sample extraction, High-density shadow in the posterior longitudinal fissure, Limb muscle weakness, Pitting edema of both lower limbs, Skin Improvement after Oxygen Inhalation, Sobbing and sighing respirations, True, Weight loss at birth, weak cry. Sample follow‑up: ",
  "Developmental Delay": "Typical symptoms: Delayed speech development, Inadequate nutritional intake, Neonatal Jaundice, Neonatal Meconium Aspiration, Oxygen requirement, Slow development of fine motor skills, Social Skills Development, True, delayed gross motor development. Sample follow‑up: ",
  "Retinopathy of Prematurity (ROP)": "Typical symptoms: History of oxygen inhalation, Mild venous dilatation, Premature birth, Spinal Bleeding, True. Sample follow‑up: ",
  "Pediatric Rhinitis": "Typical symptoms: Feeling unwell all over, Nasal congestion, Pediatrics, Sneezing, True. Sample follow‑up: ",
  "Neonatal Jaundice": "Typical symptoms: Bowel and bladder functions are normal, Breastfeeding, Good mental response, Normal weight gain, Skin jaundice, True. Sample follow‑up: ",
  "Diaper Dermatitis": "Typical symptoms: Perianal skin redness, Red spots, Small white granules, Spread of redness from the groin to the buttocks, True. Sample follow‑up: ",
  "Rotavirus Enteritis": "Typical symptoms: Diarrhea, Green jelly-like stool, Increased breast lobules, Lactose intolerance, Mucous stool, Sour and foul smell, True, Vomiting, decreased appetite. Sample follow‑up: ",
  "Infantile Eczema": "Typical symptoms: Itching, Pediatrics, Scabbing, Skin is bright red, True, rash, skin peeling. Sample follow‑up: ",
  "Pediatric Pneumonia": "Typical symptoms: Mild cough, Pediatrics, True, diarrhea, mucous stools. Sample follow‑up: ",
  "Chronic Recurrent Parotitis": "Typical symptoms: Inflammation, Pain, Periodic Recurrence, Salivary duct obstruction, Swollen salivary glands, True, leukopenia. Sample follow‑up: ",
  "Pediatric Diarrhea": "Typical symptoms: Diarrhea, Pediatrics, Somnolence, True, Vomiting, fever. Sample follow‑up: ",
  "Pediatric Fever": "Typical symptoms: Body temperature fluctuation, Forehead feels hot, Good sleep, No cough, No nasal congestion, No rapid breathing observed, No runny nose, Pediatrics, True. Sample follow‑up: ",
  "Breast Milk Jaundice": "Typical symptoms: Breastfeeding, False, Normal eating and sleeping, Skin jaundice, True, Weight Gain. Sample follow‑up: ",
  "Pectus Carinatum": "Typical symptoms: Adenoid hypertrophy, Mouth Breathing, Sleep sweating, Sternal deformity, True. Sample follow‑up: ",
  "Pediatric Anorexia": "Typical symptoms: Contains undigested food, Loose stools, Loss of appetite for all foods, Pediatrics, Poor appetite, True, Very lively person, Yellowing of hair, restless night sleep. Sample follow‑up: ",
  "Enuresis": "Typical symptoms: Bedwetting at night, Easily awakened, Partially wet pants at night, True. Sample follow‑up: ",
  "Pharyngitis": "Typical symptoms: Burning sensation in the throat, Cough, Dysphagia, Foreign body sensation, True, itchy throat. Sample follow‑up: ",
  "Adenoid Hypertrophy": "Typical symptoms: Crying at night, Impact on sleep, Nasal congestion, No nasal discharge, True. Sample follow‑up: ",
  "Exposure Keratitis": "Typical symptoms: Brainstem Stroke, Corneal perforation, Incomplete eyelid closure, Keratitis, True. Sample follow‑up: ",
  "Myopia": "Typical symptoms: 425 Degrees of Myopia in the Left Eye, 50 diopters of astigmatism in the left eye, 600 degrees of myopia in the right eye, Annual Myopia Increase of About 100 Degrees, True. Sample follow‑up: ",
  "Conjunctivitis": "Typical symptoms: Abdominal distension, Eye discharge, Jaundice, True. Sample follow‑up: ",
  "Tinnitus": "Typical symptoms: Anxiety, Decrease in sleep quality, Irritability, Tinnitus, True. Sample follow‑up: ",
  "Epistaxis": "Typical symptoms: Adenoid hypertrophy, Dry mouth, Frequent nosebleeds in the past month, Mouth breathing during sleep, Nose-picking behavior, Nosebleed during sleep at night, True. Sample follow‑up: ",
  "Ptosis": "Typical symptoms: Allergic Rhinitis, Dark Circles, Eye bags, Ptosis, True. Sample follow‑up: ",
  "Allergic Rhinitis": "Typical symptoms: Dry nose, Extremely itchy nose, Eye congestion, Frequent sneezing, Symptoms Worsen in the Morning, Thick clear nasal discharge, Throat discomfort, True, Woken up by sneezing at night, head feels heavy and swollen. Sample follow‑up: ",
  "Hordeolum (Stye)": "Typical symptoms: Dry eyes, Eyelid swelling and redness, Localized Pain, True, eye itching. Sample follow‑up: ",
  "Chronic Otitis Media": "Typical symptoms: Bitter taste in mouth, Bloody nose, Ear pain, Squishing sound in the ear when speaking or coughing, True, Water sounds in the ear. Sample follow‑up: ",
  "Chronic Sinusitis": "Typical symptoms: Dull pain from the left nose to the forehead to the temple to the top of the head, Headache, Left maxillary sinus obstruction, Postoperative fistula not healed, Temple pain as if being stabbed, True. Sample follow‑up: ",
  "Otitis Media": "Typical symptoms: Pain is paroxysmal, Right ear pain, True, ear discharge, increased ear pain while eating. Sample follow‑up: ",
  "Nasopharyngeal Carcinoma": "Typical symptoms: Facial numbness, Hearing Loss, Occasional blood streaks in nose, Tinnitus, True. Sample follow‑up: ",
  "Retinoblastoma": "Typical symptoms: Blink right eye, Cyanosis of lips, Eye rolling back, Fist Clenching, Head Shaking, Heterochromia, Mild Asphyxiation, Strabismus, True, limb stiffness, rubbing eyes. Sample follow‑up: ",
  "Chronic Pharyngitis": "Typical symptoms: Frequent forehead sweating, Left posterior pharyngeal wall swelling, Loud snoring during sleep, Pain in the left side of the neck, Slight pain in the left submandibular lymph node, True, slight soreness in the left throat. Sample follow‑up: ",
  "Acoustic Neuroma": "Typical symptoms: Decreased hearing, Dizziness and fatigue, Headache, Tinnitus, True. Sample follow‑up: ",
  "Retinal Concussion": "Typical symptoms: Bloodshot eyes, Blurred vision in the dark, Contusion, True. Sample follow‑up: ",
  "Thyroid Eye Disease": "Typical symptoms: Exophthalmos, High mental stress, Increased heart rate, Irregular eating habits, Night sweats, Severe depression, Severe inferiority complex, True, Weakness in both legs. Sample follow‑up: ",
  "Sinusitis": "Typical symptoms: Bilateral Nasal Mucosa Hypertrophy, Nasal discomfort, Orbital pain, True. Sample follow‑up: ",
  "Neurogenic Tinnitus": "Typical symptoms: High psychological stress, Insufficient Sleep, Long-term use of earplugs, Tinnitus, True. Sample follow‑up: ",
  "Dry Eye Syndrome": "Typical symptoms: Foreign body sensation in the eye, High visual workload, Swelling, True, Visual fatigue. Sample follow‑up: ",
  "Nystagmus": "Typical symptoms: Dry eye, Feeling of eyes rolling, Keratitis, True, head turned to the right. Sample follow‑up: ",
  "Conductive Hearing Loss": "Typical symptoms: Abnormal sound in the ear when opening the mouth, Hearing Loss, Intermittent loud tinnitus followed by recovery, Tinnitus, True, ear blockage. Sample follow‑up: ",
  "Chalazion": "Typical symptoms: No significant effect from erythromycin eye ointment, Redness of the lower eyelid of the right eye, Slight enlargement of the small lump, Small lump on the outer lower eyelid, True, stool hardening three days before and after. Sample follow‑up: ",
  "Vestibulitis nasi": "Typical symptoms: Increased sneezing, Significant Pain, Suppuration, True. Sample follow‑up: ",
  "Allergic Conjunctivitis": "Typical symptoms: Frequent blinking, Rubbing Nose, Rubbing the corner of the eye, True. Sample follow‑up: ",
  "Vitreous Opacity": "Typical symptoms: Constipation, Eye fatigue, Frequent dreaming at night, High mental stress, Prone to excessive internal heat, True. Sample follow‑up: ",
  "Retinal Vein Occlusion": "Typical symptoms: No edema, Retinal Vein Branch Occlusion, True, Vision essentially unaffected. Sample follow‑up: ",
  "Conjunctival Concretion": "Typical symptoms: Foreign body sensation in the eye, Frequent tearing due to sharp pain, Scattered yellow granules in the conjunctival layer, True, Yellow spherical particles found under the eyelashes expelled with tears. Sample follow‑up: ",
  "Rhinitis": "Typical symptoms: Difficulty Falling Asleep, Large amount of thick white nasal mucus, Nasal congestion, Seldom sneezing, True. Sample follow‑up: ",
  "Preauricular Sinus": "Typical symptoms: Canthus, Preauricular Pus Discharge, True, foul-smelling secretion. Sample follow‑up: ",
  "Corneal Ulcer": "Typical symptoms: Eye Pain, Eyelid adhesion, Intermittent attacks, Left eye involvement, Photophobia, Red Eye, True, unwilling to open eyes. Sample follow‑up: ",
  "Vocal Cord Polyp": "Typical symptoms: Extensive basal swelling, No obvious abnormalities in the piriform fossa, Normal bilateral vocal cord function, Poor vocal cord closure, Red swelling in the anterior-middle one third of the left vocal cord, Smooth surface swelling, True. Sample follow‑up: ",
  "Deafness": "Typical symptoms: Ear Stuffiness, Hearing Loss, Nasal congestion, True. Sample follow‑up: ",
  "Orbital Fracture": "Typical symptoms: Anxiety, Fearful, Insomnia, Large scar on the forehead, Sunken eyes, True. Sample follow‑up: ",
  "Acute Pharyngitis": "Typical symptoms: Initial Throat Itchiness, Pharyngeal pain, Right ear root pain, Sleep Disorders, True, pharyngeal scratchiness. Sample follow‑up: ",
  "Laryngeal Cancer": "Typical symptoms: Bilateral cervical multiple small lymphadenopathy, Bilateral vocal cord involvement, Coughing with blood streaks, Hypopharyngeal neoplasm, Involvement of the cricoid cartilage, Left-sided base of tongue mass, Malignant Glottic Tumor, Right aryepiglottic fold involvement, Right thyroid appears affected, Thyroid Cartilage Involvement, True, Upper esophagus involvement. Sample follow‑up: ",
  "Vocal Cord Nodules": "Typical symptoms: Hoarseness, Likes shouting, True, crying, talkativeness. Sample follow‑up: ",
  "Otosclerosis": "Typical symptoms: Bilateral Hearing Loss, Decreased Hearing of Soft Speech in Quiet, Hearing worsens with surrounding noise, Inattention, Memory Decline, Pulsatile Tinnitus Near the Ear, Tinnitus, True. Sample follow‑up: ",
  "Fetal Growth Restriction (FGR)": "Typical symptoms: Amniotic fluid fluctuation, Fetal Growth Restriction, Reduced amniotic fluid, True. Sample follow‑up: ",
  "Orchitis": "Typical symptoms: Penile pain, Symptoms of balanitis, Testicular pain, True. Sample follow‑up: ",
  "Erectile Dysfunction": "Typical symptoms: Cervical discomfort and swelling, Erectile dysfunction, Forgetfulness, Hair Loss, Premature ejaculation, Prostatitis, Short duration of sexual intercourse, True. Sample follow‑up: ",
  "Sexual Dysfunction": "Typical symptoms: Decreased libido, True, Weakness During Sexual Activity, premature ejaculation. Sample follow‑up: ",
  "Oligoasthenospermia": "Typical symptoms: Epididymal Pain, Low sperm concentration, Low sperm motility, Prolonged masturbation, Semen quality deteriorated after stopping medication, True, low total sperm motility. Sample follow‑up: ",
  "Epididymitis": "Typical symptoms: Callose ring, Ejaculatory discomfort, No fever, Pain, Sensation of Heat Expansion, Small blister-like bumps on the testicle, True, testicular swelling. Sample follow‑up: ",
  "Varicocele": "Typical symptoms: Lower abdominal pain, Occasional scrotal masses, Scrotal swelling, True. Sample follow‑up: ",
  "Nocturnal Emission": "Typical symptoms: Feeling depressed, Frequent nocturnal emission, Increasingly weak, Severe Fatigue, True, Weakness in speech. Sample follow‑up: ",
  "Hematospermia": "Typical symptoms: Hemospermia, No apparent effect after taking traditional Chinese medicine, True, Yunnan Baiyao capsules ineffective, ineffective after taking Levofloxacin. Sample follow‑up: ",
  "Azoospermia": "Typical symptoms: Had mumps during childhood, Infertility after 2 Years of Marriage, Low Follicle Stimulating Hormone, Low testosterone levels, Minor concussion from a minor car accident, No sperm found in three consecutive tests, True. Sample follow‑up: ",
  "Male Infertility": "Typical symptoms: Fatigue, Infertility for 1 Year, Profuse sweating, Prone to Sweating, True. Sample follow‑up: ",
  "Allergic Dermatitis": "Typical symptoms: Lower eyelid redness and swelling, Non-pruritic, Symptoms are intermittent, True, Upper eyelid swelling, symptoms worsened after using Longzhu ointment. Sample follow‑up: ",
  "Urticaria": "Typical symptoms: Rash, Skin itching, Symptom exacerbation after sexual activity, Symptoms worsen after fatigue, True. Sample follow‑up: ",
  "Acne": "Typical symptoms: Angular cheilitis, Frequent acne on the face, Pain, True. Sample follow‑up: ",
  "Condyloma Acuminatum": "Typical symptoms: No sensation, One or two instances of unprotected sex, True, Unidentified growth near the anus. Sample follow‑up: ",
  "Psoriasis": "Typical symptoms: Expansion of skin lesions, Hyperpigmentation of skin lesions, Limb Dermatosis, Scalp injury, Sensitivity to seafood and chili peppers, Skin itching, True. Sample follow‑up: ",
  "Contact Dermatitis": "Typical symptoms: Damaged skin barrier, Enlarged Pores, Facial burning sensation, Slightly itchy, Telangiectasia on both sides of the cheeks and nasolabial folds, True. Sample follow‑up: ",
  "Tinea Cruris": "Typical symptoms: Easy to sweat in summer, Localized dampness, Overweight, Poor drug efficacy, True. Sample follow‑up: ",
  "Perianal Eczema": "Typical symptoms: Anal itching, Hemorrhoids, Redness around the anus, True. Sample follow‑up: ",
  "Eczema": "Typical symptoms: Seasonal symptoms worsen, Skin erythema, Skin itching, Skin scratch marks, True. Sample follow‑up: ",
  "Atopic Dermatitis": "Typical symptoms: Allergic Rhinitis, Allergic to mulberry, Eczema flare-up, Rashes on the body and face, Seasonal symptom variation, True. Sample follow‑up: ",
  "Hand Eczema": "Typical symptoms: Dorsal hand eczema, Hand pain, Peeling of the fingertips, Swelling of the hands, True, Unable to extend fingers, Unable to sleep at night, itchy hands. Sample follow‑up: ",
  "Acne Vulgaris": "Typical symptoms: Closed comedones, Irregular sleep, Red swollen acne on the left cheek, Swollen pimples on the forehead, True, whiteheads on temples. Sample follow‑up: ",
  "Folliculitis": "Typical symptoms: Abscess formation, Hair breakage, Swelling and redness, Trichostasis, True. Sample follow‑up: ",
  "Pemphigus": "Typical symptoms: Head herpes, Herpes Zoster of the Chest, Herpes rupture with scarring, Herpes zoster on the back, No pain, no itch, Recurrent attacks, True. Sample follow‑up: ",
  "Paronychia": "Typical symptoms: Foot pain, Partial whitening, Refusal to wash feet, Swelling and redness, True, Unwillingness to walk, Unwillingness to wear shoes and socks, refusal to use iodine. Sample follow‑up: ",
  "Tinea Versicolor": "Typical symptoms: Brown circular spots on the chest, Flaking after scratching, Flaky spots on the surface, Mild itching sensation, Spots on neck and nape, True. Sample follow‑up: ",
  "Scrotal Eczema": "Typical symptoms: Itching at the Base of the Penis, Reddening at the base of the penis, Scrotal Redness, Scrotal exudation, Scrotal itching, Scrotal peeling, True. Sample follow‑up: ",
  "Plantar Warts": "Typical symptoms: Hard growth on the heel, Not very painful, Pain on firm pressure, True, considered to be dead skin. Sample follow‑up: ",
  "Pediatric Hemangioma": "Typical symptoms: Pain perception to laser treatment, Pediatrics, Skin hyperpigmentation, True, Vascular dermatosis. Sample follow‑up: ",
  "Dermatitis": "Typical symptoms: Differences in periocular condition between morning and evening, Eyelid Peeling, Eyelid peeling, Eyelid redness, Gastritis, Poor Sleep, Thinner and darker skin around the eyes, True, thinning of the eyelid skin. Sample follow‑up: ",
  "Pseudomolluscum Contagiosum": "Typical symptoms: Acne resembling fish roe, Apply acyclovir, Localized acne, Pain, Pimples located beside the labia minora, Presence of white pimples, Rinse with saline solution, True, localized itching. Sample follow‑up: ",
  "Warts": "Typical symptoms: Blistering after treatment, Increased skin lesions, Neither painful nor itchy, Skin discoloration, True, Undergoing cryotherapy. Sample follow‑up: ",
  "Herpes Zoster": "Typical symptoms: Low-grade fever, Numbness in the body, Purulent discharge, Skin herpes, Tenderness on Touch, True. Sample follow‑up: ",
  "Papular Urticaria": "Typical symptoms: Allergic constitution, Approximately more than 20 small nodules all over the body, Hard nodule on the packet, History of urticaria, Intense itching, Multiple Drug Treatment Ineffective, Multiple small bumps on the body, Occasional distribution in other parts of the body, Presence of solar dermatitis, Small Pouches Mainly Distributed on the Back and Hind Legs, Small bumps still present under clothing, True. Sample follow‑up: ",
  "Dermatofibroma": "Typical symptoms: A soybean-sized lump under the left knee, Mobile mass within the lump, Occasionally itchy, Rough appearance, The lump feels hard, True. Sample follow‑up: ",
  "Onychomycosis": "Typical symptoms: Damaged nails, Nail hypertrophy, Onychomycosis, True. Sample follow‑up: ",
  "Moles": "Typical symptoms: Mole enlarging, Moles on the sole of the foot, No swelling, Painless, True. Sample follow‑up: ",
  "Seborrheic Dermatitis": "Typical symptoms: Chin area becomes severe, Dandruff on the chin, Overall symptoms have significantly improved, Pain at the site of clindamycin application, Slow wound healing, Tight chin, True, feeling of scabbing on the chin, self-inflicted scratches on the chin. Sample follow‑up: ",
  "Epidermal Nevus": "Typical symptoms: Asymptomatic skin patches, Black granular patches on the abdomen, Dark marks on the neck, Increasing number of lesions over time, Symptoms previously diagnosed as verrucous epidermal nevus, True, black granular patches on the back. Sample follow‑up: ",
  "Vitiligo": "Typical symptoms: Arm depigmentation, Combined with 308 phototherapy treatment, Depigmentation around the nostrils, Depigmentation near the ear, Facial depigmentation, Pigment loss in the under-eye area, Recovery of pigment loss in the armpit, True. Sample follow‑up: ",
  "Plaque Psoriasis": "Typical symptoms: Abnormal skin on hands and feet, Long-term skin issues, True, long-term discomfort in the ankle and right elbow. Sample follow‑up: ",
  "Palmoplantar Pustulosis": "Typical symptoms: Expressible fluid, Skin peeling, Small pustule, Swelling, True, Ulceration. Sample follow‑up: ",
  "Erysipelas": "Typical symptoms: Difficulty walking, Lack of energy all over, Scald sequelae, Swelling and redness, True, fever. Sample follow‑up: ",
  "Neurodermatitis": "Typical symptoms: Abdominal red spots, Skin black spots, Skin itching, True, skin darkening. Sample follow‑up: ",
  "Hair Loss": "Typical symptoms: Hair loss during shampooing, Hair loss when combing with hands, Scalp itching, Severe hair loss, True. Sample follow‑up: ",
  "Keloids": "Typical symptoms: Early-stage deep red acne scars, Folliculitis, Small scars distributed on the chest and arms, True. Sample follow‑up: ",
  "Dyshidrosis": "Typical symptoms: Excessive hand sweating, Nodules at Finger Joints, Skin itching, Skin pain, Skin peeling, True. Sample follow‑up: ",
  "Nevus Sebaceous": "Typical symptoms: Abnormal skin growth, Darkening of the lesion area, Hair follicle blockage, Increased sebum secretion, True. Sample follow‑up: ",
  "Melasma": "Typical symptoms: No obvious improvement with medication, Pigmentation at the ends of the eyebrows and cheekbones, Slight worsening of symptoms, True. Sample follow‑up: ",
  "Axillary Osmidrosis (Body Odor)": "Typical symptoms: No strange smell on clothes, No underarm odor after bathing, Slight underarm odor after school in the afternoon, True, Underarm odor after exercise. Sample follow‑up: ",
  "Steroid-dependent dermatitis": "Typical symptoms: Recurrent skin symptoms, Skin itching, Skin rash, Symptoms worsened after discontinuing medication, Temporary improvement in skin condition after using specific ointment, True. Sample follow‑up: ",
  "Bullous Pemphigoid": "Typical symptoms: Barely able to stand with support, Decreased limb muscle strength, Herpes recurrence, Large blisters on limbs, Quadriplegia, True. Sample follow‑up: ",
  "Hepatitis B": "Typical symptoms: Anxiety, Elevated Bilirubin, Insomnia, Poor complexion, Presence of jaundice, True. Sample follow‑up: ",
  "Gastrointestinal Dysfunctions": "Typical symptoms: Bowel Urge After Eating, Dizziness, Feeling of incomplete bowel movement in the morning, Feeling sleepy, No improvement after one week of medication, Temporary relief after passing gas, True. Sample follow‑up: ",
  "Cyst": "Typical symptoms: Fever of 38.6 degrees Celsius, Neck pain, Skin reddening, Swelling of the neck, True, crying. Sample follow‑up: ",
  "Pain": "Typical symptoms: Inability to bend the knee, Joint swelling, Limb weakness, Night Sweats, Pallor, Physical fatigue, Right neck and shoulder pain, True, Unable to fully extend both arms, Unable to lift arm, Unable to squat, Weakness in hands and feet. Sample follow‑up: ",
  "Liver Disease": "Typical symptoms: Collateral circulation formation, Diffuse changes in liver echogenicity, Liver cirrhosis, Portal hypertension, Splenomegaly, True. Sample follow‑up: ",
  "Pressure Ulcer": "Typical symptoms: Spinal Protrusion, Swelling and redness, True, Ulceration, Unable to move freely, long-term friction, lumbar fracture. Sample follow‑up: ",
  "Alcoholic Cirrhosis": "Typical symptoms: Difficulty expectorating phlegm, Dizziness, Hoarse Voice, Hyperkalemia, Hyponatremia, Poor mental condition, Poor sleep, True, leg cramps. Sample follow‑up: ",
  "Hepatitis B e-Antigen Positive (HBeAg Positive)": "Typical symptoms: High Viral Load, Normal hepatic, gallbladder, and splenic ultrasound, Normal liver function, True. Sample follow‑up: ",
  "Cirrhosis": "Typical symptoms: Bitter Taste in Mouth, Oral varices, Posterior cardia, Superficial gastritis, True, Yellowish complexion, abnormal development of the caudate lobe of the liver. Sample follow‑up: ",
  "Hepatitis B 'Minor HBsAg' Carrier (Hepatitis B Small Three Yang)": "Typical symptoms: Normal liver function, Pregnancy, True, viral load 6.08e3. Sample follow‑up: ",
  "Double Eyelid Surgery": "Typical symptoms: Anisocoria, Excessively long double eyelid crease, Half-closed Eye, Lines are not smooth, Prominent muscle fibers, Ptosis of the upper eyelid, Swelling, True. Sample follow‑up: ",
  "Sciatica": "Typical symptoms: Numbness, Pain all over the body, Severe buttock pain, True, general weakness. Sample follow‑up: ",
  "Herniated Disc": "Typical symptoms: Coldness in both lower limbs, Numbness in both lower limbs, True, Year-round chills. Sample follow‑up: ",
  "Occipital Neuralgia": "Typical symptoms: Good mental state, No Dizziness, No fever, No hypertension, Normal diet, Occasional pain in the back right side of the head, True, no diabetes. Sample follow‑up: ",
  "Gait Abnormality": "Typical symptoms: Jaundice, Low body weight, Nuchal cord, Premature birth, Tip-toe walking, True. Sample follow‑up: ",
  "Ménière's Disease": "Typical symptoms: Frequent Dreams, Persistent left ear tinnitus, Poor sleep quality, Slight stiffness in the neck, Swaying from side to side when standing, feeling dizzy, True, lethargy after waking up, unsteady standing. Sample follow‑up: ",
  "Anxiety Disorder": "Typical symptoms: Difficulty Falling Asleep, Dreaming, Easily fatigued, Half asleep, half awake, High fever, Loss of appetite, Mental status fluctuations, Nausea and vomiting, Palpitations, True. Sample follow‑up: ",
  "Insomnia": "Typical symptoms: Difficulty Falling Asleep, Prone to colds, Sore throat at around 4-5 AM, Symptom exacerbation, True, sweating on exertion. Sample follow‑up: ",
  "Depression": "Typical symptoms: Depressed mood, Hard to satisfy, Irritability, Migraine, True, extreme thoughts. Sample follow‑up: ",
  "Schizophrenia": "Typical symptoms: Auditory hallucinations, Change in personality, Irritable mood, No Significant Improvement with Medication, Not easily angered or enraged, Significant mood changes after medication, Sluggish response, True. Sample follow‑up: ",
  "Autism Spectrum Disorder (ASD)": "Typical symptoms: Easily disturbed by external noises, Eating normally but not gaining weight, Language delay, Muscle weakness, Pale complexion, Sleep Disorders, Sluggish response, Social disorder, Talking to oneself, True. Sample follow‑up: ",
  "Bipolar Disorder": "Typical symptoms: Anxiety, Fear, Mania, True. Sample follow‑up: ",
  "Obsessive-Compulsive Disorder (OCD)": "Typical symptoms: Asthma, Fear of OCD relapse, Gastroesophageal reflux, High psychological stress, Nervous anxiety, True. Sample follow‑up: ",
  "Anorexia Nervosa": "Typical symptoms: Food aversion, Picky eating, Reduced food intake, Thick tongue coating, True. Sample follow‑up: ",
  "Iron Deficiency Anemia": "Typical symptoms: Anemia, Cold hands and feet, Cold intolerance, Dizziness after exercise, Easily irritable, Exercise intolerance, Headache after exercise, Increased Menstrual Flow, Prolonged Menstrual Period, Reduced hemoglobin, Shortened cycles, True. Sample follow‑up: ",
  "Chronic Monocytic Leukemia": "Typical symptoms: Bronchitis, Fever for more than a week, Hyperthyroidism, Increased Mature Monocytes, True, chronic pulmonary disease. Sample follow‑up: ",
  "Henoch-Schönlein Purpura (HSP)": "Typical symptoms: Allergy to Eggs, Milk, and Soy, Bilateral Lower Limb Purpura, No abdominal pain, No joint pain, No macroscopic hematuria, Purpura gradually spreading throughout the body, True. Sample follow‑up: ",
  "Myelodysplastic Syndromes (MDS)": "Typical symptoms: Anemia, Asthma, Heavy menstrual bleeding, Increased heart rate, True, thrombocytopenia. Sample follow‑up: ",
  "Thrombocytopenia": "Typical symptoms: Bleeding when brushing teeth, Gingival bleeding, True, thrombocytopenia. Sample follow‑up: ",
  "Immune Thrombocytopenic Purpura (ITP)": "Typical symptoms: Anemia, High fever, Petechiae, True, iron supplementation, thrombocytopenia. Sample follow‑up: ",
  "Chronic Osteomyelitis": "Typical symptoms: Long-term treatment with no significant effect, Pain, Progressively involving both legs, True, Unbroken skin. Sample follow‑up: ",
  "Polycythemia Vera": "Typical symptoms: Dizziness, Facial Flushing, Onychomycosis, Splenomegaly, True, darkened lip color, varicose veins. Sample follow‑up: ",
  "Myelofibrosis": "Typical symptoms: Fever, Hair loss, Periodic acne breakouts on face, Skin Ulceration, Splenomegaly, True. Sample follow‑up: ",
  "Leukemia": "Typical symptoms: ASXL1 mutation, Allergic to lenalidomide, IDH2 Mutation, True, increased primitive cells. Sample follow‑up: ",
  "Hyperlipidemia": "Typical symptoms: Elevated cholesterol, Elevated creatinine levels, Right renal cyst, Stones, True, elevated triglycerides. Sample follow‑up: ",
  "Acute Leukemia": "Typical symptoms: Anorexia, Gingival bleeding, Incontinence of bowel and bladder, Nausea, Red Blood Cells Below 50, Severe Anemia, True. Sample follow‑up: ",
  "Hodgkin's Lymphoma": "Typical symptoms: Fever, Increased Peritoneal Lymph Nodes, Left lobe liver bile duct stones, Lumps on both sides of the neck, Multiple small nodules in both lungs, Recurrent Mass, True, pelvic effusion. Sample follow‑up: ",
  "Acute Lymphoblastic Leukemia (ALL)": "Typical symptoms: Anemia, Liver problems, Pale complexion, Stomach discomfort, True, fever. Sample follow‑up: ",
  "Lymphoma": "Typical symptoms: Appearance of papules and macules, Axillary lymph nodes hardening, Bone marrow examination reveals abnormalities, Gradual recovery of physical strength, Headache, Loss of working capacity, Low-grade fever around 37.3°C in the afternoon, Occasional migratory bone pain, True, multiple lymphadenopathy. Sample follow‑up: ",
  "Eosinophilia": "Typical symptoms: Abdominal pain, Fatigue, Fever, Increased eosinophil percentage, Leukocytosis, Poor appetite, True. Sample follow‑up: ",
  "Sepsis": "Typical symptoms: Feed every 3.5-4 hours, Fond of sleeping, Formula feeding, High C-reactive protein, High White Blood Cell Count, Milk intake of 20-30 milliliters per feeding, True. Sample follow‑up: ",
  "Mumps": "Typical symptoms: High fever at 38.5°C, Pain all over the body, Swelling Behind the Ear, True, fever. Sample follow‑up: ",
  "Infectious Mononucleosis": "Typical symptoms: Good mental state during the day, Lethargic from afternoon to evening, Morning periorbital edema, Red vesicles, Sore throat, True. Sample follow‑up: ",
  "Infection": "Typical symptoms: Fever, Reduced Urine Output, True, excessive sweating, rash. Sample follow‑up: ",
  "Tuberculosis": "Typical symptoms: Coughing up white phlegm/saliva, False, Itchy throat, Large emotional fluctuations, Occasional anxiety, True, Upset stomach, dry cough, pain in the lower left abdomen, weight loss. Sample follow‑up: ",
  "Cervical Lymph Node Tuberculosis": "Typical symptoms: Expanding hematoma at puncture site, Hard lump, Lump turning red, Neck mass, Pain, True, Wound Itching, Wound has white pus spots, right-side mass reduced. Sample follow‑up: ",
  "Chickenpox": "Typical symptoms: Herpes, Increased Red Spots, True, general weakness, mild headache, rash and itching. Sample follow‑up: ",
  "Cytomegalovirus Infection": "Typical symptoms: Elevated ALT, Elevated indirect bilirubin, Giant cell antibody positive, Hepatitis B core antibody positive, Jaundice, True. Sample follow‑up: ",
  "Pyogenic Granuloma": "Typical symptoms: Bleeding, Peeling, Pressing Pain, Skin elevation, Thickened skin, True, purple bag, red swelling. Sample follow‑up: "
}